package java.util;

/**
 * Queue定义了两套元素的添加获取和移除
 *
 * 第一套在元素空间满或者空间内无元素抛出异常
 * 第二套在元素空间满或者空间内无元素时返回特殊的值
 */
public interface Queue<E> extends Collection<E> {
    /**
     * 添加元素,失败时抛出异常
     */
    boolean add(E e);

    /**
     * 移除元素,队列为空时抛出异常
     */
    E remove();

    /**
     * 查看第一个元素,队列为空时抛出异常
     */
    E element();



    //=================================================================================



    /**
     * 添加元素,失败时返回false
     */
    boolean offer(E e);

    /**
     * 移除元素,队列为空时返回null
     */
    E poll();

    /**
     * 查看第一个元素,队列为空时返回null
     */
    E peek();
}
